{
    "emails": [
        {
            "subject": "Thanks For Applying to Infosys!",
            "body": "Hello Mido,Thank you for submitting your application to Infosys for the position of Analyst - Data Science, 129654BR. Your candidate ID is 23056024.We will review your application, and if you are sele",
            "company": "Infosys",
            "position": "Analyst - Data Science"
        },
        {
            "subject": "Thank you for applying to Robinhood",
            "body": "Hi Mido, Thanks for applying to Robinhood! Your application has been received, and our team is in the process of reviewing it. If your profile is a good fit for the role, we'll be in touch shortly wit",
            "company": "Robinhood",
            "position": ""
        },
        {
            "subject": "You have applied to Cisco Job Software Engineer I (Intern) United States, Job ID 1427387",
            "body": "Hi Ahmad, Thank you for applying at Cisco! We think it's a great place to work, and we're excited that you're interested in joining us as a Software Engineer I (Intern) United States, Job ID 1427387 h",
            "company": "Cisco",
            "position": "Software Engineer I (Intern)"
        },
        {
            "subject": "Thank you for applying at Pencor Services",
            "body": "Thank you for applying at Pencor Services Thanks Mido! We received your application. Hello Mido Thank you for showing interest in Pencor Services and our family of companies. We appreciate your taking",
            "company": "Pencor Services",
            "position": ""
        },
        {
            "subject": "Indeed Application: Front-End Web Developer",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Front-End Web Developer"
        },
        {
            "subject": "Indeed Application: Full Stack Developer",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Full Stack Developer"
        },
        {
            "subject": "Thank you for applying at Keysight Technologies Inc",
            "body": "Hello Mido, Thank you for your interest in joining the Keysight Technologies Team! We have received your application for the position of Software Engineer (2025-46787). We will review your application",
            "company": "Keysight Technologies Inc",
            "position": "Software Engineer"
        },
        {
            "subject": "Mido, your application was sent to TalentOla",
            "body": "Your application was sent to TalentOla Python Developer TalentOla Charlotte, NC View job: https://www.linkedin.com/comm/jobs/view/4151425099/?trackingId=NmfTdl4WROOux3ccg0AAZA%3D%3D&refId=K2%2FEYBSvQc",
            "company": "TalentOla",
            "position": "Python Developer"
        },
        {
            "subject": "Mido, your application was sent to Infomatics Corp",
            "body": "Your application was sent to Infomatics Corp Node.js Developer Infomatics Corp Irving, TX View job: https://www.linkedin.com/comm/jobs/view/4161084582/?trackingId=vje8uAZrSPmGnDW4uf9D6g%3D%3D&refId=%2",
            "company": "Infomatics Corp",
            "position": "Node.js Developer"
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Mido, Thank you for your application for our Software Development Engineer position. We appreciate your interest in career opportunities with VIAVI Solutions. We are currently reviewing your appl",
            "company": "VIAVI Solutions",
            "position": "Software Development Engineer"
        },
        {
            "subject": "Thank you for applying to Patient Scheduler - 347053",
            "body": "View in Browser Hello Mido Shahrour, Thank you for taking the time to apply to our Patient Scheduler position (347053). We will contact you via phone, email, or text, if we think your experience and q",
            "company": "",
            "position": "Patient Scheduler"
        },
        {
            "subject": "Your application to D. E. Shaw Research",
            "body": "Dear Mido, This message is a follow-up on an earlier request for additional information in connection with your D. E. Shaw Research candidacy. If you remain interested in pursuing career opportunities",
            "company": "D. E. Shaw Research",
            "position": ""
        },
        {
            "subject": "Barclays: We’ve received your application! ",
            "body": "Subject: Mido Shahrour ‎- JR-0000041194 Quantitative Analytics Associate Graduate Program 2025 New York Barclays Email Classification: Restricted - External Dear Mido, Thank you for applying to Barcla",
            "company": "Barclays",
            "position": "Quantitative Analytics Associate"
        },
        {
            "subject": "Indeed Application: Analyst",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Analyst"
        },
        {
            "subject": "Thank you for applying for the Software Engineer II - PERM position",
            "body": "Dear Mido, Thank you for taking the time to apply for the Software Engineer II - PERM position at mPulse Mobile. We appreciate your interest in joining our team! Our hiring team is currently reviewing",
            "company": "mPulse Mobile",
            "position": "Software Engineer II - PERM"
        },
        {
            "subject": "Mido, Thank You for Applying to Spectrum",
            "body": "Hello, Mido. Looking for a new job can be exciting and life-changing! We appreciate your decision to apply to Spectrum. Your application was received for the following position: Software Engineer I-20",
            "company": "Spectrum",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying at Continental Finance Company",
            "body": "Thank you for applying at Continental Finance Company Thanks Mido! We received your application. Hi Mido, Thank you so much for your interest in Continental Finance Company and for taking the time to ",
            "company": "Continental Finance Company",
            "position": ""
        },
        {
            "subject": "Thank you for your application",
            "body": "Global Human Resources Dear Mido Shahrour , Thank you for submitting your application for the following position: 25004493 , Equity Quant Strategist . The evaluation process can be lengthy at times; W",
            "company": "",
            "position": "Equity Quant Strategist"
        },
        {
            "subject": "Thank you for applying to City Experiences!",
            "body": "Dear Mido: We have received your application for the position of Data Engineer. We are currently reviewing all applicants. If your qualifications are a match for our position, we will contact you to d",
            "company": "City Experiences",
            "position": "Data Engineer"
        },
        {
            "subject": "Indeed Application: Data Analyst",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Data Analyst"
        },
        {
            "subject": "Quality Manufacturing Systems, Inc. has received your application",
            "body": "Quality Manufacturing Systems, Inc. has received your application for the Software Developer job. I’ll let you know as soon as they take a look. If you’re looking for some similar jobs, here are some ",
            "company": "Quality Manufacturing Systems, Inc.",
            "position": "Software Developer"
        },
        {
            "subject": "Your application was viewed",
            "body": "Quality Manufacturing Systems, Inc. viewed your application for Software Developer. While we wait to hear from Quality Manufacturing Systems, Inc., I wanted to share some similar jobs I found for you.",
            "company": "Quality Manufacturing Systems, Inc.",
            "position": "Software Developer"
        },
        {
            "subject": "Thank you for applying for Data Client Services, Analyst at BlackRock",
            "body": "Hi Mido, Thanks for taking the time to apply for our Data Client Services, Analyst position! We know there are many great companies out there to work for, so we really appreciate your interest in join",
            "company": "BlackRock",
            "position": "Data Client Services, Analyst"
        },
        {
            "subject": "Thank you for applying to The Trade Desk",
            "body": "Mido, Thank you for taking the time to apply to The Trade Desk! We're excited to receive your application and are currently reviewing it. If we find that your experience aligns with what we’re looking",
            "company": "The Trade Desk",
            "position": ""
        },
        {
            "subject": "We have received your application!",
            "body": "Thank you for your application. We appreciate your interest in joining Spotter . We will review your application for Reporting / Data Analyst | G Sheets, Pivot Tables, PowerBI shortly, and get back to",
            "company": "Spotter",
            "position": "Reporting / Data Analyst"
        },
        {
            "subject": "We have received your application!",
            "body": "Thank you for your application. We appreciate your interest in joining Trader Interactive. We will review your application for Data Systems Analyst I shortly, and get back to you as soon as possible. ",
            "company": "Trader Interactive",
            "position": "Data Systems Analyst I"
        },
        {
            "subject": "Thank you for applying to Sigma Computing",
            "body": "Hello Ahmad, Thanks for applying to Sigma Computing. Your application has been received and we will review it right away. If your profile is a good fit for the role, we'll be in touch shortly wit",
            "company": "Sigma Computing",
            "position": ""
        },
        {
            "subject": "Jacobs - Your Application for Software Engineer - 22934",
            "body": "Hi Mido, At Jacobs, we challenge today and reinvent tomorrow. Our team of visionaries, dreamers and doers help deliver on our purpose - to create a more connected, sustainable world - and we’re excite",
            "company": "Jacobs",
            "position": "Software Engineer"
        },
        {
            "subject": "Application Received for Job #29615954",
            "body": "Dear Candidate, This message is to acknowledge receipt of your resume. We greatly appreciate your interest in the position. Your resume will be considered for our current and future opportunities. Tha",
            "company": "",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Torc Robotics!",
            "body": "Hi Mido, Thank you for beginning your application process with Torc Robotics! We are excited to learn more about your interests and how your skill set will best contribute to our vision of being the w",
            "company": "Torc Robotics",
            "position": ""
        },
        {
            "subject": "Application Received for R0000292585 2025 Cat Digital - Early Career Data Scientist / Technical Analyst (Evergreen)",
            "body": "Dear Mido, Thank you for applying for the position of R0000292585 2025 Cat Digital - Early Career Data Scientist / Technical Analyst (Evergreen). You are one step closer to joining the team that helps",
            "company": "Cat Digital",
            "position": "Early Career Data Scientist / Technical Analyst"
        },
        {
            "subject": "👋 Thank you for applying to Whatnot!",
            "body": "Hi Ahmad, Thanks so much for applying for the Cloud Security Engineer, 2025 New Grad role at Whatnot! We're so excited that you're interested in joining the fastest-growing marketplace in US history. ",
            "company": "Whatnot",
            "position": "Cloud Security Engineer"
        },
        {
            "subject": "Thank you for applying to Ohio's Electric Cooperatives",
            "body": "Thank you for applying to Ohio's Electric Cooperatives Thank you for applying to Ohio's Electric Cooperatives Dear Mido, Thank you for applying to our Operations Data Analyst job in Paulding, OH. We'v",
            "company": "Ohio's Electric Cooperatives",
            "position": "Operations Data Analyst"
        },
        {
            "subject": "Thank you for Applying",
            "body": "Hi Mido , Thank you for your interest in joining the Vertex Team! We have received your application. We take care and pride in reviewing each application so it may take a few days to hear back. We com",
            "company": "Vertex",
            "position": ""
        },
        {
            "subject": "We received your application",
            "body": "Hi Mido, Thank you for your interest in a career at Oracle! We appreciate you taking the time to submit your application for the role of Software Engineer - Global Industries - 256009. If you'd like t",
            "company": "Oracle",
            "position": "Software Engineer - Global Industries"
        },
        {
            "subject": "Thank you for applying to Greenphire",
            "body": "Ahmad, Thanks for applying to Greenphire. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Rega",
            "company": "Greenphire",
            "position": ""
        },
        {
            "subject": "Your recent job application for Analyst, Financial - 243433",
            "body": "Hello Mido, Thank you for taking the time to apply for a position for Analyst, Financial at Newmark. We are now reviewing your application and will contact you regarding next steps. There can be a del",
            "company": "Newmark",
            "position": "Analyst, Financial"
        },
        {
            "subject": "You have applied to Cisco Job Software Engineer II (Full Time) United States, Job ID 1426828",
            "body": "Hi Ahmad, Thank you for applying at Cisco! We think it's a great place to work, and we're excited that you're interested in joining us as a Software Engineer II (Full Time) United States, Job ID 14268",
            "company": "Cisco",
            "position": "Software Engineer II (Full Time)"
        },
        {
            "subject": "Update on your application to StepStone Group",
            "body": "Dear Mido, We thank you again for your interest in our Associate- Portfolio Management opportunity with StepStone Group in our La Jolla office. We wanted to let you know that we have decided to procee",
            "company": "StepStone Group",
            "position": "Associate- Portfolio Management"
        },
        {
            "subject": "Thank you for applying to Agero",
            "body": "Hi Mido, Thank you for applying to Agero! Your application has been received and will be reviewed. As a next step, based on the role you’ve applied for you may be receiving a request for information v",
            "company": "Agero",
            "position": ""
        },
        {
            "subject": "Thank you for Applying! What's Next?\" for Analyst, Financial|R0388952",
            "body": "Thank you for Applying! What's Next?\" for Analyst, Financial|R0388952 Hi Mido -We are pleased to learn that you are interested in the position of Analyst, Financial (R0388952) with the DaVita Village.",
            "company": "DaVita Village",
            "position": "Analyst, Financial"
        },
        {
            "subject": "Your job application with Deutsche Bank",
            "body": "Dear Mido Shahrour , Thank you for your application to the post of Quantitative Strategist – Credit Strats at Deutsche Bank. You may wish to sign into the Candidate Home to view the application status",
            "company": "Deutsche Bank",
            "position": "Quantitative Strategist – Credit Strats"
        },
        {
            "subject": "Indeed Application: Data Analyst",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Data Analyst"
        },
        {
            "subject": "Your application for Software Engineer I at Payscale",
            "body": "Hi Ahmad, Thank you for your interest in a career at Payscale. We have received your application for Software Engineer I. What happens now? We typically review applications within a couple of days, al",
            "company": "Payscale",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank You for Applying to Vanta!",
            "body": "Hi Mido, Thank you for applying to the Software Engineer, Entry Level role at Vanta. We appreciate your interest, and are always happy to hear from talented people like you. We'll be reviewing your ap",
            "company": "Vanta",
            "position": "Software Engineer, Entry Level"
        },
        {
            "subject": "Your application to D. E. Shaw Research",
            "body": "Dear Mido, Thank you for your interest in D. E. Shaw Research (DESRES). We are glad to have received your resume. In order to proceed with your candidacy, we need additional information from you regar",
            "company": "D. E. Shaw Research",
            "position": ""
        },
        {
            "subject": "Your application for Software Engineer at Tyler Technologies",
            "body": "Hi Ahmad, Thank you for your interest in a career at Tyler Technologies. We received your application for Software Engineer. What happens now? We will review your application and contact you if there ",
            "company": "Tyler Technologies",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank you for applying to EliseAI!",
            "body": "Hi Mido, Thanks for applying to our Software Engineer (2025 Campus Grads) role - we are thrilled that you are interested in joining us! We receive a large number of applications every day, and despite",
            "company": "EliseAI",
            "position": "Software Engineer (2025 Campus Grads)"
        },
        {
            "subject": "You've withdrawn your Amazon job application!",
            "body": "You've withdrawn your Amazon job application! Hi Ahmad, This email is to confirm that you've withdrawn your application for the position of Software Development Engineer - 2025 (US) (ID: 2828235). We ",
            "company": "Amazon",
            "position": "Software Development Engineer"
        },
        {
            "subject": "Application Received for Software Engineer, New College Grad  (20025)",
            "body": "Hello Mido Congratulations! You’ve successfully applied for the role of Software Engineer, New College Grad (20025) at Cadence. Thanks for letting us know you’re interested in joining our team. Our re",
            "company": "Cadence",
            "position": "Software Engineer, New College Grad"
        },
        {
            "subject": "Thank you for applying to Tinuiti!",
            "body": "Thanks for applying for our Software Engineer - Product position at Tinuiti. Your application has been received and will be reviewed soon. Title:What’s Next/Next Steps/What Happens Now? Due to the vol",
            "company": "Tinuiti",
            "position": "Software Engineer - Product"
        },
        {
            "subject": "Thank You for Applying!",
            "body": "Mido, Thank you for submitting your application to the Software Engineer, Black Diamond opening with SS&C Technologies Inc. Every applicant is valued at SS&C and we appreciate your interest in our org",
            "company": "SS&C Technologies Inc",
            "position": "Software Engineer, Black Diamond"
        },
        {
            "subject": "Thank you for applying!",
            "body": "Dear Mido, Thank you for expressing interest in the position of Software Engineer, R-120245. Our recruiting team will review your application and be in touch soon if we think your skills and experienc",
            "company": "",
            "position": "Software Engineer"
        },
        {
            "subject": "ACTION NEEDED: We’ve received your application for the Equity Quant Strategist position at Bank of America",
            "body": "Global Human Resources Mido , Thanks for your interest in Bank of America. We’ve received your application for the following position: 25004493 Equity Quant Strategist . To assist us in fulfilling fed",
            "company": "Bank of America",
            "position": "Equity Quant Strategist"
        },
        {
            "subject": "Thank you for applying to Global Payments!",
            "body": "Hello, Thank you for your interest in Global Payments. We have received your job application. The screening process is currently in progress. A recruiter or hiring manager will contact you if we feel ",
            "company": "Global Payments",
            "position": ""
        },
        {
            "subject": "Thank You for Your Application!",
            "body": "Dear Mido, Thank you for your interest in the Equity Research Analyst AS, Research position. We will give careful consideration to your application by reviewing the details you provided against the po",
            "company": "",
            "position": "Equity Research Analyst AS, Research"
        },
        {
            "subject": "Application Received for Software Engineer II (Burlington, MA/Greater Boston)",
            "body": "Hello Mido Congratulations! You’ve successfully applied for the role of Software Engineer II (Burlington, MA/Greater Boston) at Cadence. Thanks for letting us know you’re interested in joining our tea",
            "company": "Cadence",
            "position": "Software Engineer II"
        },
        {
            "subject": "Thank you for applying to Coalition, Inc.!",
            "body": "Mido, Thanks for applying to Coalition, Inc.. Your application has been received and we make every effort to review applications as we receive them in a timely manner. If your application seems like a",
            "company": "Coalition, Inc.",
            "position": ""
        },
        {
            "subject": "Thank you for applying!",
            "body": "Hi Mido We received your application! Thank you for your interest in the Data Scientist | Logistics Algorithms position and in continuing your career with Stitch Fix. In accordance with Stitch Fix’s I",
            "company": "Stitch Fix",
            "position": "Data Scientist | Logistics Algorithms"
        },
        {
            "subject": "Thank you for your Application",
            "body": "Powered by Global Digital HR Dear Mido , Thank you for applying to the position of Machine Learning Intern-Summer 2025- Silicon Valley, CA . We will review your experience against the position's requi",
            "company": "",
            "position": "Machine Learning Intern"
        },
        {
            "subject": "Thank you for applying",
            "body": "Mido , Thank you for applying for the position of Quantitative Investment Analyst, Equity with T. Rowe Price. This is an automatic email confirming receipt of your resume/CV and user profile informati",
            "company": "T. Rowe Price",
            "position": "Quantitative Investment Analyst, Equity"
        },
        {
            "subject": "Thank you for applying to Onbe",
            "body": "Mido, Thanks for applying to Software Development Associate Engineer here at Onbe. A member of our Talent Acquisition Team will review your application shortly. If your application seems like a good f",
            "company": "Onbe",
            "position": "Software Development Associate Engineer"
        },
        {
            "subject": "Thank you for applying to StepStone Group",
            "body": "Dear Mido, Thank you for your interest in our Associate- Portfolio Management opportunity at StepStone Group. Your application has been received and we will review it within the next 1-2 weeks. After ",
            "company": "StepStone Group",
            "position": "Associate- Portfolio Management"
        },
        {
            "subject": "Thank you for applying! | R2511212 Software Engineer / Data Scientist New College Grad- Bachelor's (Gloucester, MA) role",
            "body": "Dear Mido Shahrour , Thank you for your interest in Applied Materials! We have received your application for the position of Software Engineer / Data Scientist New College Grad- Bachelor's (Gloucester",
            "company": "Applied Materials",
            "position": "Software Engineer / Data Scientist New College Grad"
        },
        {
            "subject": "Indeed Application: Software Engineer (Onsite - Orlando, FL)",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Software Engineer"
        },
        {
            "subject": "Thanks for applying!",
            "body": "Dear Mido Shahrour, Thank you for applying to the Graduate C++ Software Engineer position at Da Vinci! We will review your CV and motivation and get back to you as soon as possible. Kind regards, Recr",
            "company": "Da Vinci",
            "position": "Graduate C++ Software Engineer"
        },
        {
            "subject": "Thank you for your application!",
            "body": "Dear Mido, Thank you for taking the first step toward a career with The Washington Post! We’ve successfully received your application for the Software Engineer, Android App Development position and wi",
            "company": "The Washington Post",
            "position": "Software Engineer, Android App Development"
        },
        {
            "subject": "Thank you for applying to Bombora!",
            "body": "Mido, Thanks for your interest in Bombora. We received your application for the Software Engineer I, Services Engineering role, and will review it as soon as we can. If your application seems like a g",
            "company": "Bombora",
            "position": "Software Engineer I, Services Engineering"
        },
        {
            "subject": "Jane Street Application Received",
            "body": "Hello, Thank you for applying for a position at Jane Street. This email is to confirm that we received your resume and will be in touch shortly regarding your status. Thank you for your interest in Ja",
            "company": "Jane Street",
            "position": ""
        },
        {
            "subject": "Thank you for applying to HeartFlow, Inc",
            "body": "Mido, Thanks for applying to HeartFlow, Inc. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. R",
            "company": "HeartFlow, Inc",
            "position": ""
        },
        {
            "subject": "Thank you for your application at AXA",
            "body": "Dear Mido Shahrour,We would like to warmly thank you for your interest in joining AXA, in the position of VIE - Software Engineer - 25000129. We confirm that we have received your application.We will ",
            "company": "AXA",
            "position": "VIE - Software Engineer"
        },
        {
            "subject": "Application Received:  4, 3, 2, 1... Ready to Launch",
            "body": "Dear Mido Shahrour , Thank you for your interest in joining Rocket Software. We have received your application for the open position of, Software Engineer I . We will carefully review your qualificati",
            "company": "Rocket Software",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying to Wonderschool",
            "body": "Mido, Thanks for applying to Wonderschool. We know that you have many great companies to choose from when approaching your job search, and are excited that you've selected Wonderschool as one of your ",
            "company": "Wonderschool",
            "position": ""
        },
        {
            "subject": "Thank You For Your Application",
            "body": "Dear Mido, Thank you for applying for the Analyst, FP&A role at AutoNation Headquarters . We truly appreciate your interest in joining our team and the effort you put into your application. Although w",
            "company": "AutoNation Headquarters",
            "position": "Analyst, FP&A"
        },
        {
            "subject": "Application received for the Data Analyst role",
            "body": "Thanks for applying, here's what's next Trouble viewing this email? View as a webpage Hi Mido, Thanks for taking the time to apply for the Data Analyst position. Keep an eye out for emails from us whi",
            "company": "",
            "position": "Data Analyst"
        },
        {
            "subject": "Thank You for Your Application!",
            "body": "Dear Mido, Thank you for your interest in the Data Integration Analyst - Parametric position. We will give careful consideration to your application by reviewing the details you provided against the p",
            "company": "",
            "position": "Data Integration Analyst - Parametric"
        },
        {
            "subject": "Thank you for applying!",
            "body": "Dear Mido, Thank you very much for applying to the Data Analytics Analyst position at Allan Myers. Your application will be reviewed by our recruiting staff, and we will contact you soon, should we fe",
            "company": "Allan Myers",
            "position": "Data Analytics Analyst"
        },
        {
            "subject": "Thank You for Applying",
            "body": "Dear Mido: We have received your recent inquiry concerning the position of Embedded Software Engineer and appreciate your interest in EnerSys. We are currently reviewing your qualifications against ou",
            "company": "EnerSys",
            "position": "Embedded Software Engineer"
        },
        {
            "subject": "Your application for Software Engineer I at CivicPlus, LLC",
            "body": "Dear Ahmad, Thank you for your interest in a career at CivicPlus, LLC. We have received your application for Software Engineer I. What happens now? We will review your application and will contact you",
            "company": "CivicPlus, LLC",
            "position": "Software Engineer I"
        },
        {
            "subject": "Mido , we have received your application",
            "body": "Hello Mido Thank you for applying for the Software Engineer- I position. Your application has been received and is currently under review. We will contact you as soon as there is an update. To track t",
            "company": "",
            "position": "Software Engineer- I"
        },
        {
            "subject": "Thank you for applying to a position at Core and Main!",
            "body": "Dear Mido, Congratulations! You've made the first step toward a potential career at Core and Main. We are thrilled to hear of your interest in employment with us! This letter is to inform you that we ",
            "company": "Core and Main",
            "position": ""
        },
        {
            "subject": "You've started your job application!",
            "body": "Dear Mido, Thanks for starting your application for job: Data Analyst If you lose track of the job application process please follow this link to return to the job application: https://tracking.icims.",
            "company": "",
            "position": "Data Analyst"
        },
        {
            "subject": "AutoNation | Your Application has been Received!",
            "body": "Hi Mido, Thank you for applying to the Analyst, FP&A position at AutoNation, America's largest automotive retailer! We are currently in the process of reviewing your application! As we tend to have a ",
            "company": "AutoNation",
            "position": "Analyst, FP&A"
        },
        {
            "subject": "Thank you for applying to WorldQuant",
            "body": "Ahmad, Thanks for applying to WorldQuant. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Rega",
            "company": "WorldQuant",
            "position": ""
        },
        {
            "subject": "Regarding Your Application to Here™",
            "body": "Hi Ahmad, Thank you very much for your interest in the Junior Full Stack Engineer position at Here™! We've received many excellent applicants, including you. We wanted to let you know that we have rec",
            "company": "Here™",
            "position": "Junior Full Stack Engineer"
        },
        {
            "subject": "Thank you for applying to Orion Innovation",
            "body": "Hi Mido, We are happy to see your application coming into our system in Orion Innovation. We want to confirm with you that we have received your application, someone will be in contact with you to lea",
            "company": "Orion Innovation",
            "position": ""
        },
        {
            "subject": "We have received your application for Software Engineer",
            "body": "Hello Mido, Thank you for your application to Software Engineer at Cloud Software Group. We love your passion for enterprise software and the cloud. If you haven't already, please check out the storie",
            "company": "Cloud Software Group",
            "position": "Software Engineer"
        },
        {
            "subject": "Thanks for applying to Adobe",
            "body": "Dear Mido Shahrour , We wanted to let you know that we received your application for the R153489 2025 University Graduate - Software Engineer role. We look forward to learning more about you and we’ll",
            "company": "Adobe",
            "position": "Software Engineer"
        },
        {
            "subject": "Indeed Application: Web Developer I",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Web Developer I"
        },
        {
            "subject": "Thank you for applying to Appian!",
            "body": "Hi Mido, Thank you for your interest in the Associate Application Engineer role at Appian ( https://www.appian.com/ ). We’re always looking for top talent so we're thrilled to receive your application",
            "company": "Appian",
            "position": "Associate Application Engineer"
        },
        {
            "subject": "Thank you for applying to Bridgewater Associates",
            "body": "Mido, Your application to Bridgewater Associates has been successfully submitted. Thank you for taking the time to apply. Our recruiting team reviews applications on a rolling basis and will reach out",
            "company": "Bridgewater Associates",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Airtable!",
            "body": "Hi Mido, Thank you for your interest in joining Airtable! We’ve received your application for our Software Engineer, New Grad (2023) position. We’re accepting applications through November 14th, and r",
            "company": "Airtable",
            "position": "Software Engineer, New Grad"
        },
        {
            "subject": "Application Received",
            "body": "Thank you for applying to the Technology Rotational Development Program position! We have received your application and a member of our Talent Acquisition team will be in touch with next steps. Arrows",
            "company": "",
            "position": "Technology Rotational Development Program"
        },
        {
            "subject": "Thank you for applying to Nuro",
            "body": "Hello Ahmad, Thank you so much for applying to Nuro! We appreciate your interest and look forward to reviewing your application. Should your experience seem like a good fit for the position we will co",
            "company": "Nuro",
            "position": ""
        },
        {
            "subject": "Thank you for applying to AspenTech!",
            "body": "Hello , Thank you for your interest in AspenTech. Your information has been received and will be reviewed soon. Our recruitment team will reach out to you if we require additional information. In the ",
            "company": "AspenTech",
            "position": ""
        },
        {
            "subject": "Thank you for your application for Data Analyst, 47517",
            "body": "Dear Mido Shahrour, Your application for the Data Analyst, 47517 role has been successfully submitted. Thank you very much for your interest in a career with the Fitch Group! Please note that due to t",
            "company": "Fitch Group",
            "position": "Data Analyst"
        },
        {
            "subject": "Thank you for applying to Twitch",
            "body": "Ahmad, Thanks for applying to Twitch. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regards,",
            "company": "Twitch",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Point72",
            "body": "Hey Mido! Thanks for applying to Point72 . Your application has been received and we will review it right away. If your application seems like a good fit for the position we'll contact you soon. Cheer",
            "company": "Point72",
            "position": ""
        },
        {
            "subject": "Thank you for your application!",
            "body": "Hi Mido, Thank you for considering LHH! As a top talent firm, we're dedicated to matching you with great opportunities. To ensure we find the best fit for you, we kindly request additional information",
            "company": "LHH",
            "position": ""
        },
        {
            "subject": "Hill International: Application Received",
            "body": "Hello Mido, We received your job application for Data Analyst. If your profile corresponds to our requirements, a member of our Talent Acquisition team will contact you. If you were requested to provi",
            "company": "Hill International",
            "position": "Data Analyst"
        },
        {
            "subject": "Thank you for applying to Red Hat",
            "body": "Hi Mido, Thank you for your interest in the Associate Software Engineer role at Red Hat. Being a Red Hatter means collaborating daily with colleagues, customers, communities, and partners to build a m",
            "company": "Red Hat",
            "position": "Associate Software Engineer"
        },
        {
            "subject": "Thank you for applying to Sigma Computing",
            "body": "Hello Ahmad, Thanks for applying to Sigma Computing. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you",
            "company": "Sigma Computing",
            "position": ""
        },
        {
            "subject": "Your recent job application for Analyst, Mergers and Acquisitions - 21011526",
            "body": "Hi Ahmad, Thank you for your application for the position of Analyst, Mergers and Acquisitions - 21011526. We are currently reviewing your experience and qualifications and a member o",
            "company": "",
            "position": "Analyst, Mergers and Acquisitions"
        },
        {
            "subject": "Thank you for applying to IXL Learning!",
            "body": "Hi Ahmad, Thank you for applying to IXL Learning. Our hiring team will review your resume soon! Please note, due to the high volume of applications we receive, we are only able to contact candidates w",
            "company": "IXL Learning",
            "position": ""
        },
        {
            "subject": "Thank you for applying to TikTok!",
            "body": "Hi Ahmad Shahrour, You did it! Great job! We have received your application for the Software Engineer - Business Account Traffic Strategy role within TikTok. Our talent acquisition team is currently r",
            "company": "TikTok",
            "position": "Software Engineer - Business Account Traffic Strategy"
        },
        {
            "subject": "Your application for the position Software Engineer I at TeleTracking Technologies, Inc. has been received",
            "body": "Disclaimer: This email has been sent by the HR team at TeleTracking Technologies, Inc. using ADP services. Dear Ahmad , Thank you for taking the time to submit your application for the Software Engine",
            "company": "TeleTracking Technologies, Inc.",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying to Old Mission",
            "body": "Hi Ahmad, Thanks for applying to Old Mission. Your application has been received and is being reviewed by our team. If we need to obtain any additional information surrounding your background a member",
            "company": "Old Mission",
            "position": ""
        },
        {
            "subject": "Thank You for Your Application!",
            "body": "Hello Mido, Thank you for your interest in the Claims Data Analyst position! We will carefully review your application and reach out should there be a mutual fit. You can check on the status of your a",
            "company": "",
            "position": "Claims Data Analyst"
        },
        {
            "subject": "Thank you for applying to HubSpot!",
            "body": "Hi Mido! We've received your application for the Software Engineer (USA) position at HubSpot. Thank you for your interest in joining the HubSpot team! We’ll review your information and if your backgro",
            "company": "HubSpot",
            "position": "Software Engineer (USA)"
        },
        {
            "subject": "Thank you for applying to Scale AI",
            "body": "Ahmad, Thanks for applying to Scale AI. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regard",
            "company": "Scale AI",
            "position": ""
        },
        {
            "subject": "Your application for Member of Technical Staff 1 (CDP) at Nutanix",
            "body": "Dear Ahmad, Our Talent Acquisition team has received your application for the Member of Technical Staff 1 (CDP) role at Nutanix. We are humbled that you are considering Nutanix as a next step in your ",
            "company": "Nutanix",
            "position": "Member of Technical Staff 1 (CDP)"
        },
        {
            "subject": "Thank you for applying at Uline!",
            "body": "Dear Mido, Thank you for your interest in a career at Uline, North America's leading distributor of shipping, packaging and industrial supplies. We are a family-owned company known for our incredible ",
            "company": "Uline",
            "position": ""
        },
        {
            "subject": "We received your job application (Job Number: 210595668)",
            "body": "Mido, We’re glad that you’re interested in a career at JPMorganChase ! Your application for the position listed below was successfully submitted and we appreciate your patience as we review all applic",
            "company": "JPMorganChase",
            "position": ""
        },
        {
            "subject": "Thank You for Applying to ServiceNow!",
            "body": "Hi Mido, Thanks for your interest in ServiceNow! We received your application for the Software Engineer-Core Platform position. Here's a quick note on what happens next. Our Talent Acquisition team wi",
            "company": "ServiceNow",
            "position": "Software Engineer-Core Platform"
        },
        {
            "subject": "Your Application with Synchrony Front-End Engineer I – Digital Servicing",
            "body": "Dear Mido, Thanks for your interest in Synchrony and submitting your application. We're in the process of reviewing your application for Front-End Engineer I – Digital Servicing We’ll be in touch soon",
            "company": "Synchrony",
            "position": "Front-End Engineer I – Digital Servicing"
        },
        {
            "subject": "Thank you for applying to ALTEN Technology USA",
            "body": "Mido, Thanks for applying to ALTEN Technology USA. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you s",
            "company": "ALTEN Technology USA",
            "position": ""
        },
        {
            "subject": "Thank you for your application!",
            "body": "Mido, Thank you for your interest in future opportunities with KLA. We are currently accepting applications for potential future openings and will keep your application on file in the event an opening",
            "company": "KLA",
            "position": ""
        },
        {
            "subject": "Thank you for your application!",
            "body": "Mido, Thank you for your interest in future opportunities with KLA. We are currently accepting applications for potential future openings and will keep your application on file in the event an opening",
            "company": "KLA",
            "position": ""
        },
        {
            "subject": "Thank you for applying to State Street",
            "body": "Dear Mido, Thank you for your interest in advancing your career at State Street. We’ve received your application for the position of Risk Monitoring, Associate 2 (Shift Timings: - 10 PM to 6:30 AM EST",
            "company": "State Street",
            "position": "Risk Monitoring, Associate 2"
        },
        {
            "subject": "Mido, thank you for applying to SoFi!",
            "body": "Hi Mido, Thanks for applying to our open Collections Associate position at SoFi. Your application has been received, and we’re excited that you want to shape a brighter financial future with us! If yo",
            "company": "SoFi",
            "position": "Collections Associate"
        },
        {
            "subject": "Thank you for applying to Talroo!",
            "body": "Hi Ahmad, Thank you so much for your interest in Talroo! This is how we felt when we received your application: Danny Pudi Love GIF by truTV's Bobcat Goldthwait's Misfits & Monsters - Find & Share on ",
            "company": "Talroo",
            "position": ""
        },
        {
            "subject": "Thank you for applying for Associate Systematic Fixed Income Trader at BlackRock",
            "body": "Hi Mido, Thanks for taking the time to apply for our Associate Systematic Fixed Income Trader position! We know there are many great companies out there to work for, so we really appreciate your inter",
            "company": "BlackRock",
            "position": "Associate Systematic Fixed Income Trader"
        },
        {
            "subject": "Leidos -Thank You For Applying to Junior Software Developer",
            "body": "Dear Mido, Thank you for your interest in working with us at Leidos! Your application for the position of Junior Software Developer is being reviewed and a recruiter will reach out if we are moving fo",
            "company": "Leidos",
            "position": "Junior Software Developer"
        },
        {
            "subject": "Thank you for applying at CBRE  - 195678 Research Analyst",
            "body": "Hello Mido, Thank you for applying to the Research Analyst role. We have successfully received your application and it is currently under review. Over the coming weeks, we will be assessing applicants",
            "company": "CBRE",
            "position": "Research Analyst"
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Mido , We appreciate your interest in our company and the position of Entry Level Software Engineer for which you applied. We do appreciate the time that you invested in your application. If you ",
            "company": "",
            "position": "Entry Level Software Engineer"
        },
        {
            "subject": "Thank you for your application! One final step!",
            "body": "Hi Mido,Thank you for your application; you have successfully applied for Entry Level Software Engineer.​​​​​​​ We're excited you are considering KBR!There's one final step!In order to track your cand",
            "company": "KBR",
            "position": "Entry Level Software Engineer"
        },
        {
            "subject": "Your application for Software Developer at Tyler Technologies",
            "body": "Hi Ahmad, Thank you for your interest in a career at Tyler Technologies. We received your application for Software Developer. What happens now? We will review your application and contact you if there",
            "company": "Tyler Technologies",
            "position": "Software Developer"
        },
        {
            "subject": "You have applied to Cisco Job Software Engineer, Job ID 1435849",
            "body": "Hi Ahmad, Thank you for applying at Cisco! We think it's a great place to work, and we're excited that you're interested in joining us as a Software Engineer, Job ID 1435849 here. What's next? Please ",
            "company": "Cisco",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank you for your application!",
            "body": "Hi Mido, Thank you for considering LHH! As a top talent firm, we're dedicated to matching you with great opportunities. To ensure we find the best fit for you, we kindly request additional information",
            "company": "LHH",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Minitab",
            "body": "Mido, Thanks for applying to Minitab . Your application has been received for Software Engineer and will be reviewed. If your application seems like a good fit for the position you will be contacted s",
            "company": "Minitab",
            "position": "Software Engineer"
        },
        {
            "subject": "Your application for Citadel's Research Data Analyst role has been received.",
            "body": "External Applicant Mido, Thank you for your interest in Citadel | Citadel Securities. We've received your application, and our hiring team will carefully review your skills and experience. We'll be in",
            "company": "Citadel | Citadel Securities",
            "position": "Research Data Analyst"
        },
        {
            "subject": "Thank you for applying to WeRide.ai",
            "body": "Dear Ahmad, Thanks for applying to WeRide.ai. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. ",
            "company": "WeRide.ai",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Affirm",
            "body": "Hi Mido, We have received your application for our Quantitative Analyst I position and appreciate your interest in joining the Affirm team! We're excited to see the incredible talent applying for this",
            "company": "Affirm",
            "position": "Quantitative Analyst I"
        },
        {
            "subject": "Thank You for Applying at Surya",
            "body": "Disclaimer: This email has been sent by the HR team at Surya Carpet using ADP services. Hello, Thank you for your interest in employment at Surya. We have received your application and if your qualifi",
            "company": "Surya Carpet",
            "position": ""
        },
        {
            "subject": "Thank you for applying to SageSure",
            "body": "Mido, Thanks for applying to SageSure. Your application for the Associate Software Engineer position has been received and our Talent Acquisition team will review it at our earliest convenience. If yo",
            "company": "SageSure",
            "position": "Associate Software Engineer"
        },
        {
            "subject": "Security code for your application to SageSure",
            "body": "Hi Mido, Copy and paste this code into the security code field on your application: iXMIvjtH After you enter the code, resubmit your application. © 2025 Greenhouse 18 West 18th Street, 11th Floor, New",
            "company": "SageSure",
            "position": ""
        },
        {
            "subject": "Thank you for applying to SambaNova Systems",
            "body": "Mido, Thanks for applying to SambaNova Systems. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon",
            "company": "SambaNova Systems",
            "position": ""
        },
        {
            "subject": "Thank You for Applying to ServiceNow!",
            "body": "Hi Mido, Thanks for your interest in ServiceNow! We received your application for the Software Engineer position. Here's a quick note on what happens next. Our Talent Acquisition team will review your",
            "company": "ServiceNow",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank you for applying at CORAL GABLES-FL [OFFICE]",
            "body": "Dear Mido, Thank you very much for your recent application to ANALYST, ANALYTICS. Your submission will be reviewed by the hiring manager. If your skills and experience are a fit for this opening, we w",
            "company": "",
            "position": "ANALYST, ANALYTICS"
        },
        {
            "subject": "Application Received",
            "body": "Dear Mido, We have received your application for Analyst, BI & Data Visualization. The application you submitted is currently under review and we appreciate your interest in joining our team. Thanks, ",
            "company": "",
            "position": "Analyst, BI & Data Visualization"
        },
        {
            "subject": "Thank you for applying to Esri!",
            "body": "Hi Mido, Thanks for your interest in Esri. We’re excited you’ve taken the first step in joining the global leader in geographic information system (GIS) software, location intelligence, and mapping. W",
            "company": "Esri",
            "position": ""
        },
        {
            "subject": "Thank you for your application",
            "body": "Dear Mido , Thank you very much for your recent application to Software Engineer I Your resume will be reviewed by our recruiting staff, and we will make sure to get in touch with you soon, should we ",
            "company": "",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank You for Applying",
            "body": "Hi Mido, We've received your application for R0106661 AWS Software Engineer - Entry Level. At USAA, we have an important mission: facilitating the financial security of millions of U.S. military membe",
            "company": "USAA",
            "position": "AWS Software Engineer - Entry Level"
        },
        {
            "subject": "Thank you for applying to Western Digital",
            "body": "Dear Mido Shahrour,Thank you for submitting your application for the position of New College Grad, Software Development Engineering (Apps). We will review your application and contact you shortly.Best",
            "company": "Western Digital",
            "position": "Software Development Engineering (Apps)"
        },
        {
            "subject": "Thank you for applying to Xerox!",
            "body": "Dear Mido: Thank you for your interest in Xerox and applying for the Associate Software Engineer position. We appreciate the opportunity to learn more about you and your professional experience. We wi",
            "company": "Xerox",
            "position": "Associate Software Engineer"
        },
        {
            "subject": "Thank you for applying!",
            "body": "Hello Mido,Congratulations! You have officially applied for a career opportunity at Itential. Thanks... ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ",
            "company": "Itential",
            "position": ""
        },
        {
            "subject": "Thank you for Applying with Criteo!",
            "body": "Hello Mido Thank you for considering Criteo and applying for our Data Analyst opportunity! You've taken the first step and now it's our turn! Your profile is being reviewed by a recruiter in our Talen",
            "company": "Criteo",
            "position": "Data Analyst"
        },
        {
            "subject": "Thank you for applying to Nexxen!",
            "body": "Hi Mido, Thank you for your interest in Nexxen! We wanted to let you know we received your application for the Software Engineer I, DSP (Demand Side Platform) role and we are pleased that you are inte",
            "company": "Nexxen",
            "position": "Software Engineer I, DSP (Demand Side Platform)"
        },
        {
            "subject": "Thank you for applying to Gelber Group for the Junior Software Engineer- Trading Technical Operations Team Opportunity",
            "body": "Ahmad, Thanks for applying to Gelber Group. Your application has been received and will be reviewed by our hiring team. If your application seems like a good fit for the position we will contact you s",
            "company": "Gelber Group",
            "position": "Junior Software Engineer- Trading Technical Operations Team"
        },
        {
            "subject": "NBA - Thank you for applying: Associate DevOps Engineer",
            "body": "Hello Ahmad, Thank you for your interest in working for the National Basketball Association. We appreciate you taking the time to apply for the Associate DevOps Engineer. We must inform you",
            "company": "National Basketball Association",
            "position": "Associate DevOps Engineer"
        },
        {
            "subject": "An update on your application with Electronic Arts - Associate Data Analyst (207418)",
            "body": "Hi Ahmad, Thanks for applying to the Associate Data Analyst (Req ID 207418) position. This position does not support relocation or immigration at this time. This does not disqualify you from other ope",
            "company": "Electronic Arts",
            "position": "Associate Data Analyst"
        },
        {
            "subject": "Thank you for applying to IXL Learning!",
            "body": "Hi Ahmad, Thank you for applying to IXL Learning. Our hiring team will review your resume soon! Please note, due to the high volume of applications we receive, we are only able to contact candidates w",
            "company": "IXL Learning",
            "position": ""
        },
        {
            "subject": "Tower Research Capital: Application Received",
            "body": "Hi Ahmad, Thanks for your interest in Tower. We've received your application, and we will be in touch should you be a match for any of our open positions. Regards, Talent Acquisition @ Tower Research ",
            "company": "Tower Research Capital",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Greenphire",
            "body": "Ahmad, Thanks for applying to Greenphire. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Rega",
            "company": "Greenphire",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Radiant",
            "body": "Ahmad, Thanks for applying to Radiant . Your application has been received and we will review it as soon as we can. If your application seems like a good fit for the position we will contact you soon.",
            "company": "Radiant",
            "position": ""
        },
        {
            "subject": "Thank you for your application for the Data Engineer I & R-92957",
            "body": "Hello Ahmad, We have received your application and appreciate your time and interest in working with Expedia Group! At Expedia Group, we're driven by our core belief that travel is a force for good. W",
            "company": "Expedia Group",
            "position": "Data Engineer I"
        },
        {
            "subject": "Thank you for applying!",
            "body": "Ahmad Shahrour , Thank you so much for applying! Your application will be taken into careful consideration. Thank you, Microchip Human Resources Please do not reply to this email. Candidate Home This ",
            "company": "Microchip",
            "position": ""
        },
        {
            "subject": "GM Financial Careers: Application Received",
            "body": "Dear Ahmad, You have successfully completed your application for the Software Development Engineer I position at GM Financial. Your submission will be reviewed by a member of the Talent Acquisition te",
            "company": "GM Financial",
            "position": "Software Development Engineer I"
        },
        {
            "subject": "Trimble Recruiting - Thank you for applying!",
            "body": "Ahmad, Thank you so much for applying for the role of Software Engineer . We are currently processing your application and will be in contact with you in due course. Please note that regardless of the",
            "company": "Trimble",
            "position": "Software Engineer"
        },
        {
            "subject": "We have received your application for Software Engineer at Trimble",
            "body": "Hello Ahmad, Thank you for your interest in the Software Engineer. We have received your application, and our Talent Attraction team will be reviewing your information shortly. Please make sure to con",
            "company": "Trimble",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad, Thank you so much for applying! Your application will be taken into careful consideration and you will hear back from us after we review your application. Thanks This email box is not moni",
            "company": "",
            "position": ""
        },
        {
            "subject": "Update on Your Application",
            "body": "Dear Ahmad , Thank you for your recent application in regards to the Junior Software Engineer . Your application has been reviewed by our recruitment team, and although your talent is valued, it has b",
            "company": "",
            "position": "Junior Software Engineer"
        },
        {
            "subject": "Thank you for your application and your interest in Mars",
            "body": "Hi Ahmad, We've received your application to start a career at Mars: Mars Finance Leadership Experience (MFLE) Full Time Financial Analyst . We know applying for a job takes some time, so we'd like to",
            "company": "Mars",
            "position": "Mars Finance Leadership Experience (MFLE) Full Time Financial Analyst"
        },
        {
            "subject": "Important information about your application to SimpliSafe",
            "body": "Hi Ahmad, Thank you for your interest in SimpliSafe and our Software Engineer I position. As you can imagine we received many qualified applicants and some aligned better than others. After careful re",
            "company": "SimpliSafe",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying to Clipboard Health",
            "body": "Ahmad, Thanks for applying to Clipboard Health. Your application has been received and we will review it right away. If your application seems like a good fit for the position, we will contact you soo",
            "company": "Clipboard Health",
            "position": ""
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad, Thank you for your application for our Software Development Engineer I (C\\C++) - Enterprise Network Performance and Cybersecurity Platform position. We appreciate your interest in career o",
            "company": "",
            "position": "Software Development Engineer I (C\\C++) - Enterprise Network Performance and Cybersecurity Platform"
        },
        {
            "subject": "Application Received for Junior Software Engineer",
            "body": "Hi Ahmad, Thank you for taking the time to apply for the position of Junior Software Engineer . We appreciate your interest in this role and IDEXX. The Recruiting team has received your application an",
            "company": "IDEXX",
            "position": "Junior Software Engineer"
        },
        {
            "subject": "Thank you for applying to Rivos Inc.",
            "body": "Hi Ahmad, We want to thank you for your interest in Rivos. We have received your application and are working as fast as we can to review it. If our hiring team sees a match to what they're looking for",
            "company": "Rivos Inc.",
            "position": ""
        },
        {
            "subject": "Thank you for your application",
            "body": "Preheader Goes Here Dear Ahmad, Thank you for your interest in the Software Engineer, Android position with NRG Energy. We will be reviewing your skills and experience to determine if they meet the re",
            "company": "NRG Energy",
            "position": "Software Engineer, Android"
        },
        {
            "subject": "Thank you for applying",
            "body": "Dear Ahmad , We would like to confirm receipt of your application and take this opportunity to thank you for your interest in ResMed! We have a team of committed Talent Acquisition people who review e",
            "company": "ResMed",
            "position": ""
        },
        {
            "subject": "Thank you for applying to SimpliSafe",
            "body": "Hi Ahmad, Thanks for checking us out and applying for the Software Engineer I position with SimpliSafe! Your application has been received and we will review it right away. If we see a match for the p",
            "company": "SimpliSafe",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thanks for applying to Associate Data Analyst (Req ID 207418) at Electronic Arts!",
            "body": "Hi Ahmad, We're excited to hear you're interested in joining Electronic Arts! Confirming we've received your application for the following role: Job Title: Associate Data Analyst Job ID: 207418 Our te",
            "company": "Electronic Arts",
            "position": "Associate Data Analyst"
        },
        {
            "subject": "Quora | Thank you for applying! | Machine Learning Engineer New Grad 2023-2025 (Remote)",
            "body": "Hi Ahmad! Thanks for applying to join the team at Quora! We're thrilled to meet you and can't wait to learn more about you. We will review your application and reach out soon if there is a good fit. I",
            "company": "Quora",
            "position": "Machine Learning Engineer New Grad"
        },
        {
            "subject": "Thank you for applying to DigiCert",
            "body": "Greetings Ahmad, We're grateful you chose to apply to the Junior Software Engineer position at DigiCert. Here are next steps for your review: Our hiring team is currently reviewing all applications an",
            "company": "DigiCert",
            "position": "Junior Software Engineer"
        },
        {
            "subject": "Thanks for applying at Manulife/John Hancock",
            "body": "Dear Ahmad Shahrour We’re excited that you’ve decided to take the first steps towards joining our Winning team! We’re committed to making decisions easier and lives better for our customers and collea",
            "company": "Manulife/John Hancock",
            "position": ""
        },
        {
            "subject": "Thank you for applying to State Street",
            "body": "Dear Ahmad, Thank you for your interest in advancing your career at State Street. We’ve received your application for the position of Software Engineer I - Senior Associate - Charles River Development",
            "company": "State Street",
            "position": "Software Engineer I - Senior Associate - Charles River Development"
        },
        {
            "subject": "Thank you for applying to Wayfair",
            "body": "Dear Ahmad, Thank you for your interest in the Data Scientist I - Experienced Graduates (Winter 2025 start) role at Wayfair. We have received your application and will be in touch if there is a match.",
            "company": "Wayfair",
            "position": "Data Scientist I - Experienced Graduates"
        },
        {
            "subject": "Application Received for Junior Software Engineer - Top 25 CS Degree position",
            "body": "Company: Simplex Position: Junior Software Engineer - Top 25 CS Degree, Austin, TX Thank you for applying for a position with one of our clients. We will process your application as quickly as possibl",
            "company": "Simplex",
            "position": "Junior Software Engineer - Top 25 CS Degree"
        },
        {
            "subject": "Thank you for applying to Scale AI",
            "body": "Ahmad, Thanks for applying to Scale AI. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regard",
            "company": "Scale AI",
            "position": ""
        },
        {
            "subject": "Application Received",
            "body": "Hi Ahmad , Thank you for applying to the Software Engineer - USA Remote position at Leica Microsystems . We appreciate your interest. We will follow up if your background and professional achievements",
            "company": "Leica Microsystems",
            "position": "Software Engineer - USA Remote"
        },
        {
            "subject": "Thank you for your application",
            "body": "Thank you for your interest in LexisNexis Risk Solutions . Your application has been received. Using your registered email address and password, you may check the status of your application anytime wi",
            "company": "LexisNexis Risk Solutions",
            "position": ""
        },
        {
            "subject": "Johnson Controls - We've received your application: WD30228345",
            "body": "Hi Ahmad, Thank you for your interest in Johnson Controls where we’re shaping the future to create a world that’s safe, comfortable and sustainable. This email is to confirm that we received your appl",
            "company": "Johnson Controls",
            "position": ""
        },
        {
            "subject": "Thanks for Applying to TREW LLC!",
            "body": "Hello Ahmad, Thank you for your interest in TREW! We just received your information for our Software Engineer I opening. For your reference, the JobID for this job is 1645. We really appreciate you ta",
            "company": "TREW LLC",
            "position": "Software Engineer I"
        },
        {
            "subject": "Indeed Application: Software Engineer I",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying to Aquatic Capital Management",
            "body": "Ahmad, Thanks for applying to Aquatic. Your application has been received and we will review it as soon as possible. If your application seems like a good fit for the position we will contact you soon",
            "company": "Aquatic Capital Management",
            "position": ""
        },
        {
            "subject": "Thank you for applying!",
            "body": "Hello Ahmad, Thank you for your interest in joining Frost! Since 1868, Frost has been investing in our employees by offering a wide range of opportunities for professional and personal growth. Your ap",
            "company": "Frost",
            "position": ""
        },
        {
            "subject": "Spectrum Careers: Update on Your Application",
            "body": "Hello Ahmad, We appreciate your interest in joining the Spectrum team. We often get an overwhelming response from individuals interested in our positions and we aren't able to review all of the applic",
            "company": "Spectrum",
            "position": ""
        },
        {
            "subject": "Thanks for applying to Dagster Labs!",
            "body": "Hi Ahmad, Thanks so much for your interest in Dagster Labs! We successfully received your application for the Software Engineer, University Grad (Fall 2025 Start) role. Our team will review your appli",
            "company": "Dagster Labs",
            "position": "Software Engineer, University Grad (Fall 2025 Start)"
        },
        {
            "subject": "Complete your application with Abbott",
            "body": "Hi Ashahrourr, ​​​​​​​Thank you for your interest in exploring career opportunities at Abbott.We noticed that you recently started an application for the Firmware Engineer I job and were not able to f",
            "company": "Abbott",
            "position": "Firmware Engineer I"
        },
        {
            "subject": "Thanks for applying to Adobe",
            "body": "Dear Ahmad Shahrour , We wanted to let you know that we received your application for the R147903 2025 University Graduate - Business Intelligence Analyst role. We look forward to learning more about ",
            "company": "Adobe",
            "position": "Business Intelligence Analyst"
        },
        {
            "subject": "Your Parsons Job Application for: [not available]",
            "body": "Dear Ahmad Please log back into your candidate home account and complete any outstanding questionnaires that are listed. If you completed these tasks as they appeared on the screen following your appl",
            "company": "Parsons",
            "position": ""
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad Shahrour , Thank you for your application for the position Manufacturing Software Engineer, Test Program Applications & Automation (2025 New College Graduate) and your interest in working a",
            "company": "",
            "position": "Manufacturing Software Engineer, Test Program Applications & Automation"
        },
        {
            "subject": "Thank You for Applying",
            "body": "Dear Ahmad, Thank you very much for your recent application to the 2025 Graduate Software Engineer I, United States position at Uber. Your submission will be reviewed by our recruiting staff, and we m",
            "company": "Uber",
            "position": "2025 Graduate Software Engineer I, United States"
        },
        {
            "subject": "Thank you for Applying to Amazon!",
            "body": "Thank you for Applying to Amazon! Hi Ahmad, Thanks for applying to Amazon! We've received your application for the Software Development Engineer I 2025 (ID: 2850044) position. What happens next? If we",
            "company": "Amazon",
            "position": "Software Development Engineer I"
        },
        {
            "subject": "Your application for Business Intelligence Analyst - OTP at Mitsubishi Power Americas, Inc.",
            "body": "Dear Ahmad​, Thank you for your application for Business Intelligence Analyst - OTP at Mitsubishi Power Americas, Inc. and for your interest in working with MHI Group. Your application is currently un",
            "company": "Mitsubishi Power Americas, Inc.",
            "position": "Business Intelligence Analyst - OTP"
        },
        {
            "subject": "Thank you for applying at ConstructConnect",
            "body": "Dear Ahmad, Thank you very much for your recent application to the Software Engineer I position at ConstructConnect. Your submission will be reviewed by our recruiting staff, and we may reach out to y",
            "company": "ConstructConnect",
            "position": "Software Engineer I"
        },
        {
            "subject": "Your application for the position Software Engineer I at TeleTracking Technologies, Inc. has been received",
            "body": "Disclaimer: This email has been sent by the HR team at TeleTracking Technologies, Inc. using ADP services. Dear Ahmad , Thank you for taking the time to submit your application for the Software Engine",
            "company": "TeleTracking Technologies, Inc.",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying to Sovrn",
            "body": "Hi Ahmad, We are thrilled you would like to join us here at Sovrn! We've received your resume and are taking a look to determine if you will be a good fit for this position. Our talent team reviews ea",
            "company": "Sovrn",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Scientech Research",
            "body": "Hi Ahmad, Thank you for applying to Scientech Research! We have received your application and will review it promptly. If we think there is a good fit, we will contact you at this email address. *Posi",
            "company": "Scientech Research",
            "position": ""
        },
        {
            "subject": "Indeed Application: Data Science Analyst",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Data Science Analyst"
        },
        {
            "subject": "Thank you for applying to Twitch",
            "body": "Ahmad, Thanks for applying to Twitch. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regards,",
            "company": "Twitch",
            "position": ""
        },
        {
            "subject": "Thanks for applying!",
            "body": "Hi Ahmad, Thank you for applying for the New College Graduate - Software Engineer role at Cape! Our recruitment team is currently reviewing applications, and we will contact you if your qualifications",
            "company": "Cape",
            "position": "New College Graduate - Software Engineer"
        },
        {
            "subject": "Thank you for Applying",
            "body": "Hi Ahmad , Thank you for your interest in joining the Vertex Team! We have received your application. We take care and pride in reviewing each application so it may take a few days to hear back. We co",
            "company": "Vertex",
            "position": ""
        },
        {
            "subject": "Complete your application with Abbott",
            "body": "Hi Ashahrourr, ​​​​​​​Thank you for your interest in exploring career opportunities at Abbott.We noticed that you recently started an application for the Firmware Engineer I job and were not able to f",
            "company": "Abbott",
            "position": "Firmware Engineer I"
        },
        {
            "subject": "Thank you for your application Arrive Logistics",
            "body": "We have received your application at Arrive Logistics . Thank you for your interest! Our team will be in touch soon. Best, Arrive Logistics Recruiting Team",
            "company": "Arrive Logistics",
            "position": ""
        },
        {
            "subject": "Thank you for applying to  Alo Yoga",
            "body": "Ahmad, Thanks for applying to the Software Engineer at Alo Yoga. We’ve received your application for the Software Engineer position and are delighted that you would consider joining our team. Our Tale",
            "company": "Alo Yoga",
            "position": "Software Engineer"
        },
        {
            "subject": "Your recent job application for Software Engineer I - 556",
            "body": "View in Browser Reach your target talent in a powerful way Hello, Ahmad, We received your job application for Software Engineer I - 556. If your profile corresponds to our requirements, a member of ou",
            "company": "",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thanks for your application to Acorns!",
            "body": "Ahmad, Thank you for taking the time to apply to the Software Engineer I, Recent Graduate position at Acorns. Please be assured we have received your application. We are delighted you would consider j",
            "company": "Acorns",
            "position": "Software Engineer I, Recent Graduate"
        },
        {
            "subject": "Indeed Application: Software Engineer I, Recent Graduate",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Software Engineer I, Recent Graduate"
        },
        {
            "subject": "Thank you for applying to Magna Tech Website Job Board",
            "body": "Ahmad, Thanks for applying to Magna Tech Website Job Board. Your application has been received! Regards, Magna Tech Website Job Board ** Please note: Do not reply to this email. This email is sent fro",
            "company": "Magna Tech Website Job Board",
            "position": ""
        },
        {
            "subject": "Indeed Application: Software Engineer",
            "body": "Your application has been submitted. Good luck! If you notice an error in your application, please Contact Indeed ------ Indeed - one search. all jobs. | Austin Indeed Tower, 200 West 6th Street, Floo",
            "company": "",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank You for Applying",
            "body": "Ahmad , Thank you for applying to the Information Technology - Software Engineers - 2025 College Grads position at our location. We are currently reviewing all applicants and will contact you if you a",
            "company": "",
            "position": "Information Technology - Software Engineers - 2025 College Grads"
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad, Thank you so much for applying! Your application will be taken into careful consideration and you will hear back from us after we review your application. Thanks This email box is not moni",
            "company": "",
            "position": ""
        },
        {
            "subject": "Thank you for applying to ByteDance!",
            "body": "Hi Ahmad Shahrour, We received your application for the Software Engineer in Large Model System Graduate (Machine Learning Sys-US) - 2024 Start (BS/MS) role within ByteDance and it's in good hands! We",
            "company": "ByteDance",
            "position": "Software Engineer in Large Model System Graduate (Machine Learning Sys-US)"
        },
        {
            "subject": "Thank You for Your Application!",
            "body": "Dear Ahmad, Thank you for your interest in the Data Integration Analyst - Parametric position. We will review the details you provided against the position criteria and give careful consideration to your ap",
            "company": "",
            "position": "Data Integration Analyst - Parametric"
        },
        {
            "subject": "Thank You for Your Application!",
            "body": "Dear Ahmad, Thank you for your interest in the Software Development Engineer I position. We will review the details you provided against the position criteria and give careful consideration to your ap",
            "company": "",
            "position": "Software Development Engineer I"
        },
        {
            "subject": "Thank you for applying to Twilio!",
            "body": "Hi Ahmad, Thank you for your interest in a role at Twilio! We just received your application. We know that job hunting can be stressful. Our intention is to be transparent about our hiring process to ",
            "company": "Twilio",
            "position": ""
        },
        {
            "subject": "Thank you for applying to PhonePe",
            "body": "Ahmad, Thanks for applying to PhonePe. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Additio",
            "company": "PhonePe",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Ambient AI",
            "body": "Hi Ahmad, Thanks for applying to Ambient AI. While we do receive a large number of applicants, rest assured that we commit to a human reading your application and we will respond in a timely manner. I",
            "company": "Ambient AI",
            "position": ""
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad Shahrour , Thank you for your application for the position Finance Rotational Accelerator Program (2025 New College Graduate) and your interest in working at GLOBALFOUNDRIES. Your applicati",
            "company": "GLOBALFOUNDRIES",
            "position": "Finance Rotational Accelerator Program"
        },
        {
            "subject": "Application Received!",
            "body": "Dear Ahmad, Thank you for applying! We have received your application and will be in touch with next steps. Kindest Regards, Human Resources Team This email box is not monitored. Please do not reply t",
            "company": "",
            "position": ""
        },
        {
            "subject": "Thank you for applying to ELEVI Associates",
            "body": "Hi Ahmad: Thank you for applying for the Entry Level Front End Developer position at ELEVI Associates. We are excited that you are considering the potential opportunity to join our company. Our Hiring",
            "company": "ELEVI Associates",
            "position": "Entry Level Front End Developer"
        },
        {
            "subject": "Important information about your application to Two Six Technologies",
            "body": "Hi Ahmad, Thank you for your interest in joining the Two Six Technologies team. We wanted to let you know that although your resume was impressive, our hiring team reviewed your application and did no",
            "company": "Two Six Technologies",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Esri!",
            "body": "Hi Ahmad, Thanks for your interest in Esri. We’re excited you’ve taken the first step in joining the global leader in geographic information system (GIS) software, location intelligence, and mapping. ",
            "company": "Esri",
            "position": ""
        },
        {
            "subject": "Thank you for submitting your application to Two Six Technologies",
            "body": "Hi Ahmad, Thank you for your interest in Two Six Technologies and for submitting your application. Your application has been received and is being thoroughly reviewed by a member of our Talent Acquisi",
            "company": "Two Six Technologies",
            "position": ""
        },
        {
            "subject": "Thank you for your application to Forward",
            "body": "Hey Ahmad! Thanks so much for applying for the Software Engineer (New Grad) role at Forward. We really appreciate your interest in our company! Just wanted to let you know that we received your applic",
            "company": "Forward",
            "position": "Software Engineer (New Grad)"
        },
        {
            "subject": "Your application to Arch",
            "body": "Dear Ahmad, We’ve reviewed your application for the Software Engineer position, and have decided not to move forward at this time. While it might not be the right fit now, we’re going to keep you in m",
            "company": "Arch",
            "position": "Software Engineer"
        },
        {
            "subject": "Your application for Software Engineer I at Mastercard",
            "body": "Thank you for Your Interest! Hello Ahmad , Thank you for expressing interest in Mastercard and the Software Engineer I position you applied for. While we were impressed with your qualifications, we’ve",
            "company": "Mastercard",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for applying at OuterBox",
            "body": "Thank you for applying at OuterBox Thanks Ahmad! We received your application. Hi Ahmad, Thank you so much for your interest in OuterBox and for taking the time to apply for the Front End Developer po",
            "company": "OuterBox",
            "position": "Front End Developer"
        },
        {
            "subject": "Thank you for applying to Vatic Labs",
            "body": "Hi Ahmad, Thank you for applying for opportunities at Vatic Labs. Your application has been received and we will review it right away. If there is interest in your application we will reach out. We ge",
            "company": "Vatic Labs",
            "position": ""
        },
        {
            "subject": "Ahmad, Thank you for applying to Pioneer Square Labs",
            "body": "Ahmad, Thank you for your interest in a career at Pioneer Square Labs. We have received your application for Engineering (General Application). What happens now? We will review your application and wi",
            "company": "Pioneer Square Labs",
            "position": "Engineering (General Application)"
        },
        {
            "subject": "Thank you for applying to The Trade Desk",
            "body": "Ahmad, Thank you for taking the time to apply to The Trade Desk! We're excited to receive your application and are currently reviewing it. If we find that your experience aligns with what we’re lookin",
            "company": "The Trade Desk",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Cambridge Mobile Telematics",
            "body": "Hi Ahmad, Thank you for applying to Cambridge Mobile Telematics! Your application has been received and will be reviewed as soon as possible. If your background is a fit, we will reach out to set up a",
            "company": "Cambridge Mobile Telematics",
            "position": ""
        },
        {
            "subject": "Thank you for applying to SpaceX",
            "body": "Hi Ahmad, Thank you for your interest in a future with SpaceX. We appreciate you taking the time to apply for the Financial Analyst position. Our team will review your qualifications and contact you i",
            "company": "SpaceX",
            "position": "Financial Analyst"
        },
        {
            "subject": "Thank You for Applying!",
            "body": "Ahmad, Thank you for submitting your application to the Financial Analyst opening with SS&C Technologies Inc. Every applicant is valued at SS&C and we appreciate your interest in our organization. You",
            "company": "SS&C Technologies Inc",
            "position": "Financial Analyst"
        },
        {
            "subject": "Thank you for applying to Ripple",
            "body": "Ahmad, Thank you for your interest in joining our team at Ripple! We have received your application and we appreciate the time and effort you put into submitting your resume. We are currently reviewin",
            "company": "Ripple",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Third Bridge",
            "body": "​Dear Ahmad, Thank you for submitting your application for the position of Associate, Private Markets Clients (2025 Start Dates). The first step in the application process is for you to take an online",
            "company": "Third Bridge",
            "position": "Associate, Private Markets Clients"
        },
        {
            "subject": "Thank You for Applying!",
            "body": "Thank you for applying! Dear Ahmad , Thank you for your interest in joining Mastercard! Your application for Software Engineer I has been received. We believe in connecting everyone to Priceless possi",
            "company": "Mastercard",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for your application for the Software Development Engineer I - Workday & R-90242",
            "body": "Hello Ahmad, We have received your application and appreciate your time and interest in working with Expedia Group! At Expedia Group, we're driven by our core belief that travel is a force for good. W",
            "company": "Expedia Group",
            "position": "Software Development Engineer I - Workday"
        },
        {
            "subject": "Thank you for applying to Nextdoor",
            "body": "Hi Ahmad, Thank you so much for your interest in Nextdoor! We have received your application and look forward to reviewing it shortly. We’ll be in touch with an update soon! In the meantime, we invite",
            "company": "Nextdoor",
            "position": ""
        },
        {
            "subject": "Application Received for Software Development Engineer 1 - New Initiatives Team",
            "body": "Dear Ahmad, Thanks for applying to Remitly. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Re",
            "company": "Remitly",
            "position": "Software Development Engineer 1 - New Initiatives Team"
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad, Thank you for your interest in employment opportunities at Vanderbilt University Medical Center. We have received your application for the position of R-30056 Associate Application Analyst",
            "company": "Vanderbilt University Medical Center",
            "position": "Associate Application Analyst"
        },
        {
            "subject": "Capital Group Careers: Thank You for Applying",
            "body": "Ahmad, Thank you for applying to our open CAMPUS: Technology Rotational Experience (TREx) Associate (2025) position. We have received your application and will review your qualifications as soon as po",
            "company": "Capital Group",
            "position": "CAMPUS: Technology Rotational Experience (TREx) Associate"
        },
        {
            "subject": "Application Received",
            "body": "Hello. Thank you for your interest with AVEVA. Your resume is currently being reviewed. If your experience matches this or any of our other current job openings, we will contact you via email or phone",
            "company": "AVEVA",
            "position": ""
        },
        {
            "subject": "Thank you for your application",
            "body": "Thank you for your interest in LexisNexis Risk Solutions . Your application has been received. Using your registered email address and password, you may check the status of your application anytime wi",
            "company": "LexisNexis Risk Solutions",
            "position": ""
        },
        {
            "subject": "Thank you for applying to T2 Systems",
            "body": "Ahmad, Thanks for applying to T2 Systems. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Rega",
            "company": "T2 Systems",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Esri!",
            "body": "Hi Ahmad, Thanks for your interest in Esri. We’re excited you’ve taken the first step in joining the global leader in geographic information system (GIS) software, location intelligence, and mapping. ",
            "company": "Esri",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Parade",
            "body": "Ahmad, Thanks for applying to Parade. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regards,",
            "company": "Parade",
            "position": ""
        },
        {
            "subject": "Thanks for applying to Adobe",
            "body": "Dear Ahmad Shahrour , We wanted to let you know that we received your application for the R148946 2025 University Graduate - Solutions Architect role. We look forward to learning more about you and we",
            "company": "Adobe",
            "position": "Solutions Architect"
        },
        {
            "subject": "Thank you for applying to Brain Corp",
            "body": "Ahmad, Thanks for applying to Brain Corp for our Software Engineer I, Applied Machine Learning position. Your application has been received and we will review it right away. If your application seems ",
            "company": "Brain Corp",
            "position": "Software Engineer I, Applied Machine Learning"
        },
        {
            "subject": "Thank you for applying to HeyGen",
            "body": "Ahmad, Thanks for applying to HeyGen. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regards,",
            "company": "HeyGen",
            "position": ""
        },
        {
            "subject": "Link to your application for 2025 Global Capital Markets Rotational Program position",
            "body": "Ahmad, Thank you for your interest in our 2025 Global Capital Markets Rotational Program position. Click the link below to access your application progress page. On this page you can see if you have a",
            "company": "",
            "position": "2025 Global Capital Markets Rotational Program"
        },
        {
            "subject": "Thank you for applying to Samsara",
            "body": "Dear Ahmad, Thank you for applying to the Software Engineer (New Grad) - US role and for choosing Samsara in your job search! Your interest means a lot to us, and we're grateful for your application. ",
            "company": "Samsara",
            "position": "Software Engineer (New Grad) - US"
        },
        {
            "subject": "Barclays: We’ve received your application! ",
            "body": "Subject: Ahmad Shahrour ‎- JR-0000015239 Risk Analyst Graduate Program 2025 New York City Barclays Email Classification: Restricted - External Dear Ahmad, Thank you for applying to Barclays and for th",
            "company": "Barclays",
            "position": "Risk Analyst Graduate Program"
        },
        {
            "subject": "Thank you for applying to Scale AI",
            "body": "Ahmad, Thanks for applying to Scale AI. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Regard",
            "company": "Scale AI",
            "position": ""
        },
        {
            "subject": "✨🌈✨ Thanks for applying to Clay! ✨🌈✨",
            "body": "Hi Ahmad, Thank you for your interest in Clay! We've received your application for the Software Engineer Early Career (2025) role, and we are delighted that you would consider molding your career with",
            "company": "Clay",
            "position": "Software Engineer Early Career"
        },
        {
            "subject": "Important information about your application to Horace Mann",
            "body": "Ahmad, Thank you for your interest in the Software Engineer I position with Horace Mann. While your skills are notable, we will be pursuing candidates that more closely fit our needs. Should another o",
            "company": "Horace Mann",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for Applying to FEG Investment Advisors!",
            "body": "Hello Ahmad, We just received your information for our Research Analyst - Global Equity opening. For your reference, the JobID for this job is 250. We really appreciate you taking the time to consider",
            "company": "FEG Investment Advisors",
            "position": "Research Analyst - Global Equity"
        },
        {
            "subject": "Thank you for applying to Coalition, Inc.!",
            "body": "Ahmad, Thanks for applying to Coalition, Inc.. Your application has been received and we make every effort to review applications as we receive them in a timely manner. If your application seems like ",
            "company": "Coalition, Inc.",
            "position": ""
        },
        {
            "subject": "Thank you for applying! | R2418574 Software Engineer - Bachelor's Degree role",
            "body": "Dear Ahmad Shahrour , Thank you for your interest in Applied Materials! We have received your application for the position of Software Engineer - Bachelor's Degree . A hiring manager will review your ",
            "company": "Applied Materials",
            "position": "Software Engineer - Bachelor's Degree"
        },
        {
            "subject": "Thank you for applying to Motional",
            "body": "Ahmad, We have received your application for the Associate Software Engineer role at Motional. Thank you for taking the time to apply and express interest in joining our team. Our hiring team will car",
            "company": "Motional",
            "position": "Associate Software Engineer"
        },
        {
            "subject": "Thank you for applying to WeRide.ai",
            "body": "Dear Ahmad, Thanks for applying to WeRide.ai. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. ",
            "company": "WeRide.ai",
            "position": ""
        },
        {
            "subject": "Thanks for applying to Adobe",
            "body": "Dear Ahmad Shahrour , We wanted to let you know that we received your application for the R148212 2025 Digital Academy University Graduate - Software Development Engineer role. We look forward to lear",
            "company": "Adobe",
            "position": "Software Development Engineer"
        },
        {
            "subject": "Thank you for applying to Samsara",
            "body": "Dear Ahmad, Thank you for applying to the Software Engineer - Ingestion role and for choosing Samsara in your job search! Your interest means a lot to us, and we're grateful for your application. Our ",
            "company": "Samsara",
            "position": "Software Engineer - Ingestion"
        },
        {
            "subject": "Thank you for applying to Aquatic Capital Management",
            "body": "Ahmad, Thanks for applying to Aquatic Capital Management. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contac",
            "company": "Aquatic Capital Management",
            "position": ""
        },
        {
            "subject": "Your application for Member of Technical Staff 2: CDP Stargate at Nutanix",
            "body": "Dear Ahmad, Our Talent Acquisition team has received your application for the Member of Technical Staff 2: CDP Stargate role at Nutanix. We are humbled that you are considering Nutanix as a next step ",
            "company": "Nutanix",
            "position": "Member of Technical Staff 2: CDP Stargate"
        },
        {
            "subject": "Thanks for your application to Koddi",
            "body": "Hi Ahmad, Thanks for your interest in Koddi! We received your application and we are excited that you would consider joining our team. Applying for a job can be exciting – and nerve-wracking. Especial",
            "company": "Koddi",
            "position": ""
        },
        {
            "subject": "Thank You for Applying to Blue Origin!",
            "body": "Thank you for taking the time to apply for the 2025 University Grad- DevOps Engineer, Lunar Permanence role at Blue Origin. We will review your application and contact you if there is a good fit. If y",
            "company": "Blue Origin",
            "position": "DevOps Engineer, Lunar Permanence"
        },
        {
            "subject": "Thank you for applying to GSA Capital",
            "body": "GSA Thanks for submitting your details, Ahmad. We'll be in touch soon. Regards, GSA Capital ** Please note: Do not reply to this email. This email is sent from an unattended mailbox. Replies will not ",
            "company": "GSA Capital",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Chicago Trading Company (CTC)",
            "body": "Hi Ahmad, Thanks for applying to the C++ Software Engineer role. Your application has been received and will be reviewed. If your application seems like a good fit for the position we will contact you",
            "company": "Chicago Trading Company (CTC)",
            "position": "C++ Software Engineer"
        },
        {
            "subject": "Thank you for applying to Vatic Labs",
            "body": "Hi Ahmad, Thank you for applying for opportunities at Vatic Labs. Your application has been received and we will review it right away. If there is interest in your application we will reach out. We ge",
            "company": "Vatic Labs",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Squarepoint Capital",
            "body": "Hi Ahmad, Thank you for applying for the Junior Quant Researcher - ML Alpha Research position at Squarepoint. Your application has been received and will be carefully reviewed by our hiring team. Our ",
            "company": "Squarepoint Capital",
            "position": "Junior Quant Researcher - ML Alpha Research"
        },
        {
            "subject": "Thank you for applying to AlphaGrep Securities",
            "body": "Ahmad, Thanks for applying to AlphaGrep Securities. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you ",
            "company": "AlphaGrep Securities",
            "position": ""
        },
        {
            "subject": "Tower Research Capital LLC: Application Received",
            "body": "Hi Ahmad, Thanks for your interest in Tower—we got your resume, and we are excited to review it! We will consider you for all of our campus positions, so you do not need to apply to them separately. S",
            "company": "Tower Research Capital LLC",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Jump Trading!",
            "body": "Dear Ahmad, Thank you for your interest in potential opportunities with Jump Trading. Your details have been added to our database and are under review. Should we feel that your background is a fit fo",
            "company": "Jump Trading",
            "position": ""
        },
        {
            "subject": "Ahmad, Thanks for Applying for Salesforce's Software Engineer, Frontend - Slack (Multiple Levels)",
            "body": "Hi Ahmad, Hooray! You have officially applied for the Software Engineer, Frontend - Slack (Multiple Levels) opening at Salesforce. Thank you for letting us know you’re interested in discovering new op",
            "company": "Salesforce",
            "position": "Software Engineer, Frontend - Slack (Multiple Levels)"
        },
        {
            "subject": "Thank you for applying to State Street",
            "body": "Dear Ahmad, Thank you for your interest in advancing your career at State Street. We’ve received your application for the position of Software Engineer, Charles River Development, Off . We are excited",
            "company": "State Street",
            "position": "Software Engineer, Charles River Development"
        },
        {
            "subject": "Thank you for applying to HeartFlow, Inc",
            "body": "Ahmad, Thanks for applying to HeartFlow, Inc. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. ",
            "company": "HeartFlow, Inc",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Horace Mann",
            "body": "Ahmad, Thanks for applying for the Software Engineer I position with Horace Mann. Your application has been received and is being reviewed. If you are selected to move forward in our interview process",
            "company": "Horace Mann",
            "position": "Software Engineer I"
        },
        {
            "subject": "Thank you for Applying to UMG!",
            "body": "Dear Ahmad , Thank you for your interest in the Junior Software Developer position at Universal Music Group ! We are excited that you want to take your love of music to the next level by joining us in",
            "company": "Universal Music Group",
            "position": "Junior Software Developer"
        },
        {
            "subject": "Thank you for applying to Codazen",
            "body": "Hi Ahmad, Thanks for applying to Codazen. We just wanted to let you know that we received your application, and that we're looking forward to reviewing it. If your application seems like a good fit fo",
            "company": "Codazen",
            "position": ""
        },
        {
            "subject": "Your application to the D. E. Shaw group",
            "body": "Dear Ahmad, Your application has been received and will be carefully considered by a member of our recruiting team. Thank you for your interest in the D. E. Shaw group. Best, Human Capital | Recruitin",
            "company": "D. E. Shaw group",
            "position": ""
        },
        {
            "subject": "Thank you for applying to WorldQuant",
            "body": "Ahmad, Thanks for applying to WorldQuant. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Rega",
            "company": "WorldQuant",
            "position": ""
        },
        {
            "subject": "Ahmad, we have received your application",
            "body": "Hello Ahmad, We have received your application for Commodities Quantitative Researcher, Systematic Global Macro. We are currently reviewing your information and will reach out again as soon as there i",
            "company": "",
            "position": "Commodities Quantitative Researcher, Systematic Global Macro"
        },
        {
            "subject": "Thank you for applying to DRW",
            "body": "Hi Ahmad, Thanks for your interest in DRW and for taking the time to submit your details. Your application has been received and we will review it right away. If your background is a fit for this spec",
            "company": "DRW",
            "position": ""
        },
        {
            "subject": "Thanks for applying to Trexquant Investment",
            "body": "Trexquant Investment ------------------------------------------------------------------------------- Your application for the Quantitative Researcher - Early Career (USA) job was submitted successfull",
            "company": "Trexquant Investment",
            "position": "Quantitative Researcher - Early Career (USA)"
        },
        {
            "subject": "Your Application",
            "body": "Dear Ahmad, We appreciate your interest in joining London Stock Exchange Group (LSEG) and the effort you put into submitting your application with us. We will be reviewing your application for ' R0091",
            "company": "London Stock Exchange Group (LSEG)",
            "position": ""
        },
        {
            "subject": "Thank you for applying to WorldQuant",
            "body": "Ahmad, Thanks for applying to WorldQuant. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you soon. Rega",
            "company": "WorldQuant",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Old Mission",
            "body": "Hi Ahmad, Thanks for applying to Old Mission. Your application has been received and is being reviewed by our team. If we need to obtain any additional information surrounding your background a member",
            "company": "Old Mission",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Voya!",
            "body": "Hi Ahmad Shahrour, Thank you for your application! We’ve received your information for the position of Jr. Quant Research Analyst. Our Recruiting Team is currently reviewing your profile, and if your ",
            "company": "Voya",
            "position": "Jr. Quant Research Analyst"
        },
        {
            "subject": "Thank you for applying!",
            "body": "Dear Ahmad: We have received your application for the position of Software Engineer (May 2025 Grad, Remote) and are currently reviewing your experience and qualifications. If you would like to review ",
            "company": "",
            "position": "Software Engineer (May 2025 Grad, Remote)"
        },
        {
            "subject": "Cerebras Systems | Thank you for applying - Distributed Software Engineer, New Grad",
            "body": "Hi Ahmad, Thank you for considering Cerebras Systems. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact yo",
            "company": "Cerebras Systems",
            "position": "Distributed Software Engineer, New Grad"
        },
        {
            "subject": "Thank you for applying",
            "body": "Subject: Ahmad Shahrour ‎- R0207024 Digital Transformation Consultant, Junior (C02059739) Thanks Ahmad Shahrour! We just received your application for the Digital Transformation Consultant, Junior pos",
            "company": "",
            "position": "Digital Transformation Consultant, Junior"
        },
        {
            "subject": "Thank you for applying to GitLab",
            "body": "Hi Ahmad, Thanks for applying to GitLab! We're thrilled you'd consider joining us, and wanted to confirm that we have received your application for the Intermediate Backend Engineer, AI Powered: Model",
            "company": "GitLab",
            "position": "Intermediate Backend Engineer, AI Powered: Model"
        },
        {
            "subject": "Thank you for applying to SparkCognition",
            "body": "Ahmad, Thanks for your interest in joining SparkCognition at such an exciting time! We have received your application and we'll review it right away. If your application seems like a good fit for the ",
            "company": "SparkCognition",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Coalition, Inc.!",
            "body": "Ahmad, Thanks for applying to Coalition, Inc.. Your application has been received and we make every effort to review applications as we receive them in a timely manner. If your application seems like ",
            "company": "Coalition, Inc.",
            "position": ""
        },
        {
            "subject": "Thank you for your application!",
            "body": "Ahmad, Thank you for applying to our Software Engineer position, 2426018. We will review your profile and provide you with an update at our earliest opportunity. To check the status of your applicatio",
            "company": "",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank You for Applying to 10066328-WD Intrepid Investment Banking Professional | Analyst - June 2025 at MUFG",
            "body": "Dear Ahmad, Thank you for your interest in the Intrepid Investment Banking Professional | Analyst - June 2025 position at MUFG, where we are committed and inspired by our vision to be the world’s most",
            "company": "MUFG",
            "position": "Intrepid Investment Banking Professional | Analyst - June 2025"
        },
        {
            "subject": "Thank you for applying to FactSet!",
            "body": "Dear Ahmad, Thank you completing the first steps on the path to becoming part of the FactSet Advantage! Your application for the Software Engineer - Americas Campus (July 2025) position has been recei",
            "company": "FactSet",
            "position": "Software Engineer - Americas Campus"
        },
        {
            "subject": "Thank You For Applying!",
            "body": "Dear Ahmad, Thank you so much for applying! Your application will be taken into careful consideration and you will hear back from us after we review your application. Thank you This email box is not m",
            "company": "",
            "position": ""
        },
        {
            "subject": "Thank you for applying to AlphaGrep Securities",
            "body": "Ahmad, Thanks for applying to AlphaGrep Securities. Your application has been received and we will review it right away. If your application seems like a good fit for the position we will contact you ",
            "company": "AlphaGrep Securities",
            "position": ""
        },
        {
            "subject": "Thank you for applying to PDT Partners",
            "body": "Hi Ahmad, Thanks for applying to PDT Partners. Your application for our Trading Operations Analyst role has been received and we will review it right away. If your application seems like a good fit fo",
            "company": "PDT Partners",
            "position": "Trading Operations Analyst"
        },
        {
            "subject": "TD Careers: Thanks for your application!Carrières à la TD : Merci pour votre candidature!",
            "body": "Hi Ahmad We've received your application for our 2025 Full-Time Analyst Program - CIB Credit (New York) role at TD Bank Group (TD). Our team is committed to making your candidate journey a positive an",
            "company": "TD Bank Group (TD)",
            "position": "2025 Full-Time Analyst Program - CIB Credit (New York)"
        },
        {
            "subject": "Thank you for applying for the Software Engineer II - Architecture  Role at Illumio!",
            "body": "*********************** Thank you for applying! *********************** Hi Ahmad, Thank you for submitting your application to the Software Engineer II - Architecture role and your interest to join us",
            "company": "Illumio",
            "position": "Software Engineer II - Architecture"
        },
        {
            "subject": "Thank you for applying to Arch!",
            "body": "Hi Ahmad, Thank you for applying for the Software Engineer position at Arch. We appreciate your interest in joining the team and the effort you put into submitting your application with us. Our hiring",
            "company": "Arch",
            "position": "Software Engineer"
        },
        {
            "subject": "Thank you for your application to Hive",
            "body": "Hi Ahmad, Thank you for your interest in Hive! Our team has received your application for Software Engineer - Backend, and we are delighted that you would consider joining our team. If your qualificat",
            "company": "Hive",
            "position": "Software Engineer - Backend"
        },
        {
            "subject": "Thank you for applying to OKX",
            "body": "Hi Ahmad, Thanks for applying to OKX for the position Software Engineer, New Grad. We are pleased to confirm we have received your application. We aim to get back to you as soon as possible to let you",
            "company": "OKX",
            "position": "Software Engineer, New Grad"
        },
        {
            "subject": "Thank You for Applying to Goldman Sachs",
            "body": "Hi Ahmad Shahrour, Thank you for your application. A member of our recruiting team will reach out if your experience and skills are a match for this opportunity. Please be aware that timelines for rev",
            "company": "Goldman Sachs",
            "position": ""
        },
        {
            "subject": "Thank you for your application!",
            "body": "Hello, Thank you for applying to the R0010144 2025 Campus Recruitment - Software Engineering Development Program (Evergreen) (Open) position at Cognex. A member of the Cognex Recruitment team will be ",
            "company": "Cognex",
            "position": "Software Engineering Development Program"
        },
        {
            "subject": "Your Application to Labelbox – Next Steps",
            "body": "Hi Ahmad, Thank you for applying to join the team at Labelbox! We are thrilled to receive your application and are currently reviewing it. We appreciate your interest in being a part of our mission to",
            "company": "Labelbox",
            "position": ""
        },
        {
            "subject": "Thank you for applying to Codazen",
            "body": "Hi Ahmad, Thanks for applying to Codazen. We just wanted to let you know that we received your application, and that we're looking forward to reviewing it. If your application seems like a good fit fo",
            "company": "Codazen",
            "position": ""
        }
    ]
}